bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/TINY/ATTINY5.xml
<?xml version="1.0" encoding="UTF-8"?>
<part-description-file>
  <variants>
      <variant ordercode="ATtiny5-TSHR" speedmax="12000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5" package="SOT23-6" pinout="SOT23_6"/>
      <variant ordercode="ATtiny5-MAHR" speedmax="12000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5" package="UDFN8" pinout="UDFN8"/>
      <variant ordercode="ATtiny5-TS8R" speedmax="10000000" tempmin="-40" tempmax="125" vccmin="1.8" vccmax="5.5" package="SOT23-6" pinout="SOT23_6"/>
  </variants>
  <devices>
    <device name="ATtiny5" architecture="AVR8L" family="tinyAVR">
      <address-spaces>
        <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x0200">
          <memory-segment start="0x0000" size="0x0200" type="flash" rw="RW" exec="1" name="FLASH" pagesize="0x80"/>
        </address-space>
        <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
          <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
        </address-space>
        <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0001">
          <memory-segment start="0" size="0x0001" type="fuses" rw="RW" exec="0" name="FUSES"/>
        </address-space>
        <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
          <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
        </address-space>
        <address-space size="0x4200" start="0x0000" endianness="little" name="data" id="data">
          <memory-segment type="io" size="0x40" start="0x0000" name="IO"/>
          <memory-segment type="ram" size="0x20" start="0x0040" name="SRAM"/>
          <memory-segment type="sysreg" size="0x0002" start="0x3F00" name="MAPPED_NVM_LOCK_BITS"/>
          <memory-segment type="sysreg" size="0x0002" start="0x3F40" name="MAPPED_CONFIGURATION_BITS"/>
          <memory-segment type="sysreg" size="0x0002" start="0x3F80" name="MAPPED_CALIBRATION_BITS"/>
          <memory-segment type="sysreg" size="0x0004" start="0x3FC0" name="MAPPED_DEVICE_ID_BITS"/>
          <memory-segment type="flash" start="0x4000" name="MAPPED_FLASH" size="0x0200"/>
        </address-space>
      </address-spaces>
      <peripherals>
        <module name="ADC">
          <instance name="ADC" caption="Analog-to-Digital Converter">
            <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data" caption="Analog-to-Digital Converter"/>
            <signals>
              <signal group="ADC" index="0" pad="PB0" function="default"/>
              <signal group="ADC" index="1" pad="PB1" function="default"/>
              <signal group="ADC" index="2" pad="PB2" function="default"/>
              <signal group="ADC" index="3" pad="PB3" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="AC">
          <instance name="AC" caption="Analog Comparator">
            <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data" caption="Analog Comparator"/>
            <signals>
              <signal group="AIN" index="0" pad="PB0" function="default"/>
              <signal group="AIN" index="1" pad="PB1" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="CPU">
          <instance name="CPU" caption="CPU Registers">
            <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data" caption="CPU Registers"/>
          <parameters>
        <param name="CORE_VERSION" value="AVR8L_0"/>
      </parameters></instance>
        </module>
        <module name="PORT">
          <instance name="PORTB" caption="I/O Port">
            <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data" caption="I/O Port"/>
            <signals>
              <signal group="P" function="default" pad="PB0" index="0"/>
              <signal group="P" function="default" pad="PB1" index="1"/>
              <signal group="P" function="default" pad="PB2" index="2"/>
              <signal group="P" function="default" pad="PB3" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="EXINT">
          <instance name="EXINT" caption="External Interrupts">
            <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data" caption="External Interrupts"/>
            <signals>
              <signal group="PCINT" index="0" pad="PB0" function="default"/>
              <signal group="PCINT" index="1" pad="PB1" function="default"/>
              <signal group="PCINT" index="2" pad="PB2" function="default"/>
              <signal group="PCINT" index="3" pad="PB3" function="default"/>
              <signal group="INT" index="0" pad="PB2" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="TC16">
          <instance name="TC0" caption="Timer/Counter, 16-bit">
            <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
            <signals>
              <signal group="OCA" pad="PB0" function="default"/>
              <signal group="OCB" pad="PB1" function="default"/>
              <signal group="T" pad="PB2" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="WDT">
          <instance name="WDT" caption="Watchdog Timer">
            <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data" caption="Watchdog Timer"/>
          </instance>
        </module>
        <module name="FUSE">
          <instance name="FUSE" caption="Fuses">
            <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses" caption="Fuses"/>
          </instance>
        </module>
        <module name="LOCKBIT">
          <instance name="LOCKBIT" caption="Lockbits">
            <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits" caption="Lockbits"/>
