bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/TINY/ATTINY5.xml
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x39" size="1" mask="0xFF"/>
        <register caption="Sleep Mode Control Register" name="SMCR" offset="0x3A" size="1">
          <bitfield caption="Sleep Mode Select Bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
        </register>
        <register caption="Power Reduction Register" name="PRR" offset="0x35" size="1">
          <bitfield caption="Power Reduction ADC" mask="0x02" name="PRADC"/>
          <bitfield caption="Power Reduction Timer/Counter0" mask="0x01" name="PRTIM0"/>
        </register>
        <register caption="Vcc Level Monitoring Control and Status Register" name="VLMCSR" offset="0x34" size="1">
          <bitfield caption="VLM Flag" mask="0x80" name="VLMF"/>
          <bitfield caption="VLM Interrupt Enable" mask="0x40" name="VLMIE"/>
          <bitfield caption="Trigger Level of Voltage Level Monitor bits" mask="0x07" name="VLM"/>
        </register>
        <register caption="Reset Flag Register" name="RSTFLR" offset="0x3B" size="1">
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on Reset Flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Non-Volatile Memory Control and Status Register" name="NVMCSR" offset="0x32" size="1">
          <bitfield caption="Non-Volatile Memory Busy" mask="0x80" name="NVMBSY"/>
        </register>
        <register caption="Non-Volatile Memory Command" name="NVMCMD" offset="0x33" size="1" mask="0x3F"/>
      </register-group>
      <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
        <value caption="256" name="VAL_0x08" value="0x08"/>
      </value-group>
      <value-group caption="Sleep Mode" name="CPU_SLEEP_MODE_3BITS">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Reserved" name="VAL_0x03" value="0x03"/>
        <value caption="Standby" name="STDBY" value="0x04"/>
        <value caption="Reserved" name="VAL_0x05" value="0x05"/>
        <value caption="Reserved" name="VAL_0x06" value="0x06"/>
        <value caption="Reserved" name="VAL_0x07" value="0x07"/>
      </value-group>
      
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port Control Register" name="PORTCR" offset="0x0C" size="1">
          <bitfield caption="Break-Before-Make Mode Enable" mask="0x02" name="BBMB"/>
        </register>
        <register caption="Pull-up Enable Control Register" name="PUEB" offset="0x03" size="1" mask="0x0F"/>
        <register caption="Data Direction Register, Port B" name="DDRB" offset="0x01" size="1" mask="0x0F"/>
        <register caption="Port B Data register" name="PINB" offset="0x00" size="1" mask="0x0F"/>
        <register caption="Input Pins, Port B" name="PORTB" offset="0x02" size="1" mask="0x0F"/>
      </register-group>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="External Interrupt Control Register A" name="EICRA" offset="0x15" size="1">
          <bitfield caption="Interrupt Sense Control 0 Bit 1" mask="0x02" name="ISC01"/>
          <bitfield caption="Interrupt Sense Control 0 Bit 0" mask="0x01" name="ISC00"/>
        </register>
        <register caption="External Interrupt Mask register" name="EIMSK" offset="0x13" size="1">
          <bitfield caption="External Interrupt Request 0 Enable" mask="0x01" name="INT0"/>
        </register>
        <register caption="External Interrupt Flag register" name="EIFR" offset="0x14" size="1">
          <bitfield caption="External Interrupt Flag 0" mask="0x01" name="INTF0"/>
        </register>
        <register caption="Pin Change Interrupt Control Register" name="PCICR" offset="0x12" size="1">
          <bitfield caption="Pin Change Interrupt Enable 0" mask="0x01" name="PCIE0"/>
        </register>
        <register caption="Pin Change Interrupt Flag Register" name="PCIFR" offset="0x11" size="1">
          <bitfield caption="Pin Change Interrupt Flag 0" mask="0x01" name="PCIF0"/>
        </register>
        <register caption="Pin Change Mask Register" name="PCMSK" offset="0x10" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0x0F" name="PCINT"/>
        </register>
      </register-group>
    </module>
    <module caption="Timer/Counter, 16-bit" name="TC16">
      <register-group caption="Timer/Counter, 16-bit" name="TC0">
        <register caption="Timer/Counter 0 Control Register A" name="TCCR0A" offset="0x2E" size="1">
          <bitfield caption="Compare Output Mode for Channel A bits" mask="0xC0" name="COM0A"/>
          <bitfield caption="Compare Output Mode for Channel B bits" mask="0x30" name="COM0B"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM0"/>
        </register>
        <register caption="Timer/Counter 0 Control Register B" name="TCCR0B" offset="0x2D" size="1">
          <bitfield caption="Input Capture Noise Canceler" mask="0x80" name="ICNC0"/>
          <bitfield caption="Input Capture Edge Select" mask="0x40" name="ICES0"/>
          <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM0" lsb="2"/>
          <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter 0 Control Register C" name="TCCR0C" offset="0x2C" size="1">
          <bitfield caption="Force Output Compare for Channel A" mask="0x80" name="FOC0A"/>
          <bitfield caption="Force Output Compare for Channel B" mask="0x40" name="FOC0B"/>
        </register>
